**Linear Regression Using Multiple Variables**

https://www.youtube.com/watch?v=J_LnPL3Qg70

https://github.com/codebasics/py/tree/master/ML/2_linear_reg_multivariate/Exercise

In [ ]:
!pip install pandas matplotlib sklearn word2number

In [ ]:
import math
import numpy as np
import pandas as pd
from word2number import w2n
from sklearn import linear_model
from io import StringIO

In [ ]:
HIRING_CSV_STR = """
experience,test_score,interview_score,salary
,8,9,50000
,8,6,45000
five,6,7,60000
two,10,10,65000
seven,9,6,70000
three,7,10,62000
ten,,7,72000
eleven,7,8,80000
"""
df = pd.read_csv(StringIO(HIRING_CSV_STR))
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [ ]:
# Data Preprocessing: Handling NA Values
# df.experience = df.experience.apply(lambda x: w2n.word_to_num(x) if type(x) is str else x)
# df.experience = df.experience.fillna(df.experience.median())
df.experience = df.experience.fillna('zero')
df.experience = df.experience.apply(lambda x: w2n.word_to_num(x))
df.test_score = df.test_score.fillna(math.floor(df.test_score.median()))
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [ ]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience', 'test_score', 'interview_score']], df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
reg.predict([[2,9,6], [12,10,10]])

array([53205.96797671, 92002.18340611])

In [ ]:
"""
b - intercept
y - dependent variable
x1, x2, x3 - independent variables (features)
m1, m2, m3 - coefficients (slopes)
y = m1 * x1 + m2 * x2 + m3 * x3 + b
"""
b = reg.intercept_
m1, m2, m3 = reg.coef_
y1 = m1 * 2 + m2 * 9 + m3 * 6 + b
y2 = m1 * 12 + m2 * 10 + m3 * 10 + b
y1, y2

(53205.96797671033, 92002.18340611353)